# KeyBasedTreeEntry Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
KeyBasedTreeEntry Properties
KeyBasedTreeEntry Class See Also
---
The KeyBasedTreeEntry type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Key | The key of this entry. |
| ParentKey | The parent key of this entry. |

# See Also
KeyBasedTreeEntry Class
Autodesk.Revit.DB Namespace